parsing-tech-log/src/InformationRegisters/СвойстваСобытия/СвойстваСобытия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваСобытия</name>
  <attributes>
    <name>ЗначениеСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Замер</name>
    <type>
      <types>CatalogRef.Замеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСобытия</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <type>
      <types>CatalogRef.Свойства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Процесс</name>
    <type>
      <types>CatalogRef.Процессы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцессID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодФайла</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

parsing-tech-log/src/InformationRegisters/Журнал/Журнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Журнал</name>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗначениеСвойств</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Замер</name>
    <type>
      <types>CatalogRef.Замеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Процесс</name>
    <type>
      <types>CatalogRef.Процессы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцессID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодФайла</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоляПериода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСобытия</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

parsing-tech-log/src/InformationRegisters/СвойстваСобытия/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура СобытиеОткрыть(Команда)
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить(ПолучитьКлючСобытия());
	ЖурналКлючЗаписи = Новый(Тип("РегистрСведенийКлючЗаписи.Журнал"), ПараметрыКонструктора);
	ПараметрыФормы = Новый Структура("Ключ,ТолькоПросмотр", ЖурналКлючЗаписи, Истина);
	ОткрытьФорму("РегистрСведений.Журнал.Форма.ФормаЗаписи", ПараметрыФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючСобытия()
	СтруктураКлюча = Новый Структура("Замер,Процесс,ПроцессID,ПериодФайла,ПериодСобытия,ДоляПериода,Событие,КлючСобытия");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Журнал.Замер,
	|	Журнал.Процесс,
	|	Журнал.ПроцессID,
	|	Журнал.ПериодФайла,
	|	Журнал.ПериодСобытия,
	|	Журнал.ДоляПериода,
	|	Журнал.Событие,
	|	Журнал.КлючСобытия
	|ИЗ
	|	РегистрСведений.Журнал КАК Журнал
	|ГДЕ
	|	Журнал.Замер = &Замер
	|	И Журнал.Процесс = &Процесс
	|	И Журнал.ПроцессID = &ПроцессID
	|	И Журнал.ПериодФайла = &ПериодФайла
	|	И Журнал.ПериодСобытия = &ПериодСобытия
	|	И Журнал.КлючСобытия = &КлючСобытия";
	Запрос.УстановитьПараметр("Замер", Запись.Замер);
	Запрос.УстановитьПараметр("Процесс", Запись.Процесс);
	Запрос.УстановитьПараметр("ПроцессID", Запись.ПроцессID);
	Запрос.УстановитьПараметр("ПериодФайла", Запись.ПериодФайла);
	Запрос.УстановитьПараметр("ПериодСобытия", Запись.ПериодСобытия);
	Запрос.УстановитьПараметр("КлючСобытия", Запись.КлючСобытия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(СтруктураКлюча, Выборка);
	
	Возврат СтруктураКлюча;
КонецФункции
